In [97]:
import numpy as np
import pandas as pd

In [98]:
# Load the dataset
data = pd.read_csv("House Data.csv")
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [99]:
data.shape

(13320, 9)

In [100]:
data.describe

<bound method NDFrame.describe of                   area_type   availability                  location  \
0      Super built-up  Area         19-Dec  Electronic City Phase II
1                Plot  Area  Ready To Move          Chikka Tirupathi
2            Built-up  Area  Ready To Move               Uttarahalli
3      Super built-up  Area  Ready To Move        Lingadheeranahalli
4      Super built-up  Area  Ready To Move                  Kothanur
...                     ...            ...                       ...
13315        Built-up  Area  Ready To Move                Whitefield
13316  Super built-up  Area  Ready To Move             Richards Town
13317        Built-up  Area  Ready To Move     Raja Rajeshwari Nagar
13318  Super built-up  Area         18-Jun           Padmanabhanagar
13319  Super built-up  Area  Ready To Move              Doddathoguru

            size  society total_sqft  bath  balcony   price
0          2 BHK  Coomee        1056   2.0      1.0   39.07
1      4 Bedroom  Theanmp       2600   5.0      3.0  120.00
2          3 BHK      NaN       1440   2.0      3.0   62.00
3          3 BHK  Soiewre       1521   3.0      1.0   95.00
4          2 BHK      NaN       1200   2.0      1.0   51.00
...          ...      ...        ...   ...      ...     ...
13315  5 Bedroom  ArsiaEx       3453   4.0      0.0  231.00
13316      4 BHK      NaN       3600   5.0      NaN  400.00
13317      2 BHK  Mahla T       1141   2.0      1.0   60.00
13318      4 BHK  SollyCl       4689   4.0      1.0  488.00
13319      1 BHK      NaN        550   1.0      1.0   17.00

[13320 rows x 9 columns]>

In [101]:
data.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [102]:
data.drop(columns=["area_type","availability","society","balcony"],inplace=True)

In [103]:
data.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [104]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [105]:
data["location"].value_counts()

Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1305, dtype: int64

In [106]:
data["location"] = data["location"].fillna("Sarjapur Road")

In [107]:
data["size"].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64

In [108]:
data["size"] = data["size"].fillna("2 BHK")

In [109]:
data["bath"] = data["bath"].fillna(data["bath"].median())

In [110]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13320 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [111]:
data["bhk"]=data["size"].str.split().str.get(0).astype(int)

In [112]:
data[data.bhk>20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [113]:
data["total_sqft"].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [114]:
def convertRange(x):
    temp = x.split('_')
    if len (temp) == 2:
        return(float(temp[0])  + float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [115]:
data["total_sqft"] = data["total_sqft"].apply(convertRange)

In [116]:
data.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [117]:
#price per squre feet
data["price_per_sqft"] = data["price"] = 100000 / data ["total_sqft"]

In [118]:
data["price_per_sqft"]

0         94.696970
1         38.461538
2         69.444444
3         65.746220
4         83.333333
            ...
13315     28.960324
13316     27.777778
13317     87.642419
13318     21.326509
13319    181.818182
Name: price_per_sqft, Length: 13320, dtype: float64

In [119]:
data.describe()

         total_sqft          bath          price           bhk  price_per_sqft
count  13073.000000  13320.000000   13073.000000  13320.000000    13073.000000
mean    1554.942029      2.688814      90.246815      2.802778       90.246815
std     1238.458773      1.338754     898.070032      1.294496      898.070032
min        1.000000      1.000000       1.913070      1.000000        1.913070
25%     1100.000000      2.000000      59.880240      2.000000       59.880240
50%     1275.000000      2.000000      78.431373      3.000000       78.431373
75%     1670.000000      3.000000      90.909091      3.000000       90.909091
max    52272.000000     40.000000  100000.000000     43.000000   100000.000000

In [120]:
data["location"].value_counts()

Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Uvce Layout                         1
Abshot Layout                       1
Name: location, Length: 1306, dtype: int64

In [121]:
data["location"] = data["location"].apply(lambda x: x.strip())
location_count = data["location"].value_counts()

In [122]:
location_count

Whitefield                            541
Sarjapur  Road                        399
Electronic City                       304
Kanakpura Road                        273
Thanisandra                           237
                                     ...
1Channasandra                           1
Hosahalli                               1
Vijayabank bank layout                  1
near Ramanashree California resort      1
Abshot Layout                           1
Name: location, Length: 1295, dtype: int64

In [123]:
location_count_less_10 =location_count[location_count<=10]
location_count_less_10

BTM 1st Stage                         10
Nagadevanahalli                       10
Basapura                              10
Sector 1 HSR Layout                   10
Dairy Circle                          10
                                      ..
1Channasandra                          1
Hosahalli                              1
Vijayabank bank layout                 1
near Ramanashree California resort     1
Abshot Layout                          1
Name: location, Length: 1054, dtype: int64

In [124]:
data["location"]=data["location"].apply(lambda x: "other" if x in location_count_less_10 else x)

In [125]:
data["location"].value_counts()

other                 2886
Whitefield             541
Sarjapur  Road         399
Electronic City        304
Kanakpura Road         273
                      ...
Nehru Nagar             11
Banjara Layout          11
LB Shastri Nagar        11
Pattandur Agrahara      11
Narayanapura            11
Name: location, Length: 242, dtype: int64

In [126]:
data.describe()

         total_sqft          bath          price           bhk  price_per_sqft
count  13073.000000  13320.000000   13073.000000  13320.000000    13073.000000
mean    1554.942029      2.688814      90.246815      2.802778       90.246815
std     1238.458773      1.338754     898.070032      1.294496      898.070032
min        1.000000      1.000000       1.913070      1.000000        1.913070
25%     1100.000000      2.000000      59.880240      2.000000       59.880240
50%     1275.000000      2.000000      78.431373      3.000000       78.431373
75%     1670.000000      3.000000      90.909091      3.000000       90.909091
max    52272.000000     40.000000  100000.000000     43.000000   100000.000000

In [127]:
(data["total_sqft"]/data["bhk"]).describe()

count    13073.000000
mean       573.254923
std        389.887823
min          0.250000
25%        472.000000
50%        551.000000
75%        625.000000
max      26136.000000
dtype: float64

In [128]:
data = data[((data["total_sqft"]/data["bhk"]) >=300)]
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12329.000000  12329.000000  12329.000000  12329.000000    12329.000000
mean    1590.166773      2.561441     76.938542      2.651472       76.938542
std     1261.827604      1.072551     31.477411      0.973754       31.477411
min      300.000000      1.000000      1.913070      1.000000        1.913070
25%     1118.000000      2.000000     58.823529      2.000000       58.823529
50%     1300.000000      2.000000     76.923077      3.000000       76.923077
75%     1700.000000      3.000000     89.445438      3.000000       89.445438
max    52272.000000     16.000000    333.333333     16.000000      333.333333

In [129]:
data.shape

(12329, 7)

In [130]:
data.price_per_sqft.describe()

count    12329.000000
mean        76.938542
std         31.477411
min          1.913070
25%         58.823529
50%         76.923077
75%         89.445438
max        333.333333
Name: price_per_sqft, dtype: float64

In [131]:
def bhk_oulier_remover(df):
    exclude_indices = np.array([])
    for location,location_df in df.groupby("location"):
        bhk_stats = {}
        for bhk,bhk_df in location_df.groupby("bhk"):
            bhk_stats[bhk] = {
                "mean": np.mean(bhk_df.price_per_sqft),
                "std": np.std(bhk_df.price_per_sqft),
                "count": bhk_df.shape[0]
            }
        for bhk,bhk_df in location_df.groupby("bhk"):
            stats = bhk_stats.get(bhk-1)
            if stats and stats["count"]>5:
                exclude_indices = np.append(exclude_indices,bhk_df[bhk_df.price_per_sqft<(stats["mean"])].index.values)
    return df.drop(exclude_indices,axis="index")

In [132]:
data=bhk_oulier_remover(data)

In [133]:
data.shape

(5017, 7)

In [134]:
data

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,94.696970,2,94.696970
3,Lingadheeranahalli,3 BHK,1521.0,3.0,65.746220,3,65.746220
4,Kothanur,2 BHK,1200.0,2.0,83.333333,2,83.333333
6,Old Airport Road,4 BHK,2732.0,4.0,36.603221,4,36.603221
12,7th Phase JP Nagar,2 BHK,1000.0,2.0,100.000000,2,100.000000
...,...,...,...,...,...,...,...
13310,Rachenahalli,2 BHK,1050.0,2.0,95.238095,2,95.238095
13312,Bellandur,2 BHK,1262.0,2.0,79.239303,2,79.239303
13314,Green Glen Layout,3 BHK,1715.0,3.0,58.309038,3,58.309038
13317,Raja Rajeshwari Nagar,2 BHK,1141.0,2.0,87.642419,2,87.642419
13319,Doddathoguru,1 BHK,550.0,1.0,181.818182,1,181.818182

In [135]:
data.drop(columns=["size","price_per_sqft"],inplace=True)

In [136]:
data.head()

                    location  total_sqft  bath       price  bhk
0   Electronic City Phase II      1056.0   2.0   94.696970    2
3         Lingadheeranahalli      1521.0   3.0   65.746220    3
4                   Kothanur      1200.0   2.0   83.333333    2
6           Old Airport Road      2732.0   4.0   36.603221    4
12        7th Phase JP Nagar      1000.0   2.0  100.000000    2

In [137]:
data.to_csv("Cleaned_data.csv")

In [138]:
X=data.drop(columns =["price"])
y=data["price"]

In [139]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder,StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [140]:
X_train,X_test,y_train,y_test = train_test_split(X,y, test_size =0.2, random_state=0)

In [141]:
print(X_train.shape)
print(X_test.shape)

(4013, 4)
(1004, 4)

In [142]:
column_trans = make_column_transformer((OneHotEncoder(sparse=False),["location"]),remainder="passthrough")

In [143]:
scaler = StandardScaler()

In [4]:
li = LinearRegression(normalize=True)

NameError: name 'LinearRegression' is not defined

In [3]:
pipe = make_pipeline(column_trans,scaler,li)

NameError: name 'make_pipeline' is not defined

In [1]:
pipe.fit(X_train,y_train)

NameError: name 'pipe' is not defined

In [ ]:
y_pred_lr = pipe.predict(X_test)

In [ ]:
r2_score(y_test, y_pred_lr)

In [ ]:
lasso = Lasso()

In [ ]:
pipe = make_pipeline(column_trans,scaler,lasso)

In [ ]:
pipe.fit(X_train,y_train)

In [ ]:
y_pred_lasso = pipe.predict(X_test)
r2_score(y_test, y_pred_lasso)

In [ ]:
ridge = Ridge()

In [ ]:
pipe = make_pipeline(column_trans,scaler,ridge)

In [ ]:
pipe.fit(X_train,y_train)

In [ ]:
y_pred_ridge = pipe.predict(X_test)
r2_score(y_test, y_pred_ridge)

In [ ]:
print("No Regularization: " , r2_score(y_test,y_pred_lr))
print("Lasso: " , r2_score(y_test, y_pred_lasso))
print("Ridge: " , r2_score(y_test, y_pred_ridge))

In [ ]:
import pickle

In [ ]:
pickle.dump(pipe,open("House.pkl","wb"))